---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentTakeoffProjlength
source: html/8eb449d2-c9b6-b0dc-0d3f-73e59ddcf4c9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentTakeoffProjlength Property

"Takeoff Length Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsFamilyContentTakeoffProjlength { get; }
```